app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "a cat w/ shoes"], ["updated_at", "2022-11-12 23:25:10.563741"], ["id", 2]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)